{
    "meta": {
        "theme": "kendall"
    },
    "basics": {
        "name": "Edgar Hsieh",
        "label": "AI Networking Engineer",
        "picture": "https://media.licdn.com/dms/image/v2/C4E03AQEhOK6aDXc9PA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1535696153320?e=1759968000&v=beta&t=LujIparPIh7gtIzUOHhsvmibAZwSvyzyN4WY4yGoclM",
        "email": "edgar.kl.hsieh@gmail.com",
        "phone": "(886) 967028013",
        "website": "",
        "summary": "AI Networking Engineer with five published studies on network security and data synchronization. Specializing in intelligent threat detection and resilient system design, I am seeking to apply my research and development skills to solve complex network infrastructure challenges.",
        "location": {
            "address": "Park Road",
            "postalCode": "244013",
            "city": "Linkou Dist.",
            "countryCode": "TW",
            "region": "New Taipei"
        },
        "profiles": [
            {
                "network": "LinkedIn",
                "username": "Edgar",
                "url": "https://www.linkedin.com/in/edgar-b0962a117"
            },
            {
                "network": "GitHub",
                "username": "Edgar",
                "url": "https://github.com/pcdean2000"
            }
        ],
        "url": "https://www.linkedin.com/in/edgar-b0962a117/",
        "image": "https://media.licdn.com/dms/image/v2/C4E03AQEhOK6aDXc9PA/profile-displayphoto-shrink_800_800/profile-displayphoto-shrink_800_800/0/1535696153561?e=1759968000&v=beta&t=JJ52hIm-_cDk8qOapvZM_93Hbt57OG6sKkaWRf8XyCI"
    },
    "work": [
        {
            "company": "Industrial Technology Research Institute",
            "position": "Assistant Engineer",
            "website": "https://www.itri.org.tw/",
            "startDate": "2023-04-01",
            "endDate": "2024-07-31",
            "summary": "Leading R&D projects in AI-driven thermal control, high-availability network design, O-RAN virtualization, and satellite network architecture simulation at ITRI.",
            "highlights": [
                "AI-Driven Thermal Control Module Development: To address the power consumption and thermal challenges in an all-in-one immersion cooling system for O-RAN base stations, I led the development of an AI-powered thermal prediction module. By integrating sensor data via Zabbix and Modbus and utilizing an LSTM forecaster model, the power prediction model achieved 99% accuracy with only six months of data.",
                "High-Availability Network Patent Proposal: Proposed a multi-gateway seamless switching system patent to solve connection interruption issues for mobile devices switching between base stations, Wi-Fi, and satellite networks. The design combines VPN Tunnelling, SDN, and MPTCP principles to ensure zero service interruption for upper-layer applications during underlying route changes.",
                "O-RAN Virtualization Solution Technology Transfer: Solely managed a technology transfer project for HTC to build their O-RAN virtualization capabilities. I was singularly responsible for implementation, achieving all four KPI scenarios, authoring a 30+ page technical document, conducting two training sessions, and providing a year of consulting. This successfully concluded a two-year-stalled project and prevented potential legal disputes for the institute.",
                "Satellite Network Architecture Simulation & Validation: Validated the feasibility of our team's routing and architecture designs for a LEO satellite network project. Using SGP4 and a self-developed framework, my simulation analysis confirmed that the proposed architectures were upward-compatible across different satellite quantities, eliminating the need to reposition deployed satellites and significantly reducing future deployment costs and complexity."
            ],
            "name": "ITRI",
            "location": "Hsinchu, TW",
            "url": "https://www.itri.org.tw/"
        },
        {
            "company": "Industrial Technology Research Institute",
            "position": "Intern",
            "website": "https://www.itri.org.tw/",
            "startDate": "2022-04-01",
            "endDate": "2023-03-31",
            "summary": "Internship focused on developing high-availability mechanisms, carbon footprint frameworks, O-Cloud platforms, and AI-based thermal control models at ITRI.",
            "highlights": [
                "High-Availability (HA) Mechanism Implementation: Designed and implemented an HA auto-recovery mechanism to meet Wiwynn's stringent system stability requirements for an O-RAN platform. By combining custom monitoring scripts with Kubernetes' three Probe mechanisms, the system was enabled to automatically restart during software failures or power interruptions, ensuring service continuity and preventing permanent outages.",
                "Proposed a carbon footprint calculation framework for data centers.",
                "Delivered an O-Cloud platform as the annual technology showcase.",
                "Developed an AI-based thermal control model for data center environments."
            ],
            "name": "ITRI",
            "location": "Hsinchu, TW",
            "url": "https://www.itri.org.tw/"
        },
        {
            "name": "Protocol Engineering and Application Research Laboratory",
            "position": "Research Assistant",
            "website": "https://ms15.voip.edu.tw/",
            "startDate": "2019-09-01",
            "endDate": "2022-03-31",
            "location": "Nantou, TW",
            "summary": "Conducted research on network security and data synchronization, resulting in multiple published papers and funded proposals.",
            "highlights": [
                "Submitted 4 MOST research proposals; 2 funded, 1 rejected, 1 transferred before review.",
                "Published 2 conference papers (TANET, ICJMEF)."
            ],
            "url": "https://ms15.voip.edu.tw/"
        },
        {
            "name": "National Chi-Nan University",
            "position": "Dormitory Network Infrastructure Coordinator",
            "startDate": "2016-09-01",
            "endDate": "2022-03-31",
            "location": "Nantou, TW",
            "url": "https://www.ncnu.edu.tw/",
            "summary": "Managed and maintained the network infrastructure for a university dormitory housing 400+ students, ensuring reliable connectivity and prompt issue resolution.",
            "description": "",
            "highlights": [
                "Major Network Outage Resolution: Led the response to a critical broadcast storm that disrupted network services for approximately 200 students across two dormitory floors. Using Wireshark for systematic, layer-by-layer troubleshooting, we identified and resolved the network loop caused by improper cabling within 2 hours and coordinated the decommissioning of legacy equipment to prevent future incidents.",
                "Managed 20 Juniper EX2200 switches with admin privileges.",
                "Supported residents with network setup and troubleshooting."
            ]
        }
    ],
    "volunteer": [],
    "education": [
        {
            "institution": "National Chi-Nan University",
            "area": "Computer Science and Information Engineering",
            "studyType": "Ph.D. program",
            "startDate": "2019-09-01",
            "endDate": "2026-01-31",
            "gpa": "",
            "courses": []
        },
        {
            "institution": "National Chi-Nan University",
            "area": "Computer Science and Information Engineering",
            "studyType": "Bachelor",
            "startDate": "2015-09-01",
            "endDate": "2019-06-30",
            "score": "",
            "courses": []
        }
    ],
    "awards": [],
    "publications": [
        {
            "name": "On the Selection of Statistical Feature Set of NetFlow Data for Operating System Identification",
            "publisher": "Computer Networks",
            "releaseDate": "2025-12",
            "url": "https://drive.google.com/open?id=1FSAoZkR6pBa164uPMHJPlXnWhrkoaK5P&usp=drive_fs",
            "summary": "This study demonstrates that fundamental NetFlow features—such as link quantity, TCP port usage, and connection duration—can significantly enhance OS type detection, achieving a 10% F1 score improvement and 29.86% faster training time using SHAP-selected attributes while challenging the reliability of traditionally favored features like TTL."
        },
        {
            "name": "Netflow-based Operating System Identification Using Machine Learning",
            "publisher": "JICV",
            "releaseDate": "2025-05",
            "url": "https://drive.google.com/open?id=1CPxtjnuGvlcyt7KsURfazEATYdk3D-gu&usp=drive_fs",
            "summary": "This study examines the feasibility of utilizing basic NetFlow attributes for OS type detection, showing that metrics such as link count, TCP port usage, and connection duration can enhance balanced accuracy by 8% compared to traditional methods while maintaining cost-effectiveness."
        },
        {
            "name": "Network Anomaly Detection Based on NetFlow Time Series Data in aHealthcare Network Environment",
            "publisher": "APAMI",
            "releaseDate": "2022-10-14",
            "url": "https://drive.google.com/open?id=1SW4-lSYLXFiR_oKt3vPjbKVa7BbVMXvT&usp=drive_fs",
            "summary": "This research introduces a time-series-based feature design and multi-factor clustering approach to detect anomalous network nodes by leveraging temporal similarity and data correlation."
        },
        {
            "name": "基於 NetFlow 時間序列資料之網路異常行為偵測 (Network Anomaly Detection Based on NetFlow Time Series Data)",
            "publisher": "IJCMEF",
            "releaseDate": "2022-07-02",
            "url": "https://drive.google.com/open?id=1BZ-Bu2PJ8UapH99sLywo8zeG64RrhsgA&usp=drive_fs",
            "summary": "This study transforms packet flow data into time-series feature vectors and applies a multi-factor cumulative clustering algorithm to identify anomalous nodes based on temporal similarity and data correlation."
        },
        {
            "name": "SimpleSync: A Better Solution of Synchronization on NDN",
            "publisher": "TANET",
            "releaseDate": "2018",
            "website": "https://scientificamerican.com",
            "summary": "A paper detailing the development and impact of the packet synchronization method on NDN.",
            "url": "https://drive.google.com/open?id=1-Pnxk5X0bVvBVoOd5W0CKJU9VdXaiU9V&usp=drive_fs"
        }
    ],
    "skills": [
        {
            "name": "AI Agent",
            "level": "",
            "keywords": [
                "Fine-Tuning",
                "RAG",
                "MCP"
            ]
        },
        {
            "name": "Virtualization",
            "level": "",
            "keywords": [
                "Kubernetes",
                "High Availability",
                "Automation"
            ]
        }
    ],
    "languages": [
        {
            "language": "Chinese",
            "fluency": "Native speaker"
        },
        {
            "language": "English",
            "fluency": "Intermediate"
        }
    ],
    "interests": [
        {
            "name": "Research and Development",
            "keywords": [
                "Innovations",
                "Experimentation"
            ]
        }
    ],
    "references": []
}